import 'package:flutter/material.dart';
import 'package:gol_pouneh/shared/appbar.dart';

class Terms extends StatefulWidget {
  const Terms({Key? key}) : super(key: key);

  @override
  State<Terms> createState() => _TermsState();
}

class _TermsState extends State<Terms> {
  List<bool> exp = List.generate(1, (index) => false);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: appBar("قوانین و مقررات"),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.stretch,
            children: [
              ruleItem(
                  "قوانین و مقررات",
                  " گل پونه شرکتی پیشتاز در ایران است که با تولید و فراوری انواع سبزیجات ، صیفی جات و غذای نیمه آماده بخشی از سبد غذایی هر خانواده اصیل ایرانی را داراست\nگل پونه می کوشد با نوآوری در محصولات و خدمات صنعت غذایی ، با تیکه بر سرمایه های انسانی خود ، نامی پرآوازه در ایران برای خود ایجاد کند\nتوجه داشته باشید کلیه اصول ورویه های گل پونه منطبق با قوانین جمهوری اسلامی ایران ، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با کاربر است\nدر صورتی که در قوانین مندرج ، رویه ها ، و سرویس های گل پونه ، تغیراتی در آینده ایجاد شود ، در همین صحفه منتشر و به روز رسانی می شود و شما توافق می کنید که استفاده مستمر شما از سایت به معنی پذیرش هرگونه تغییر است .\n\nتعریف مشتری یا کاربر\nمشتری یا کاربر به شخصی گفته می شود که بااطلاعات کاربری خود که در فرم ثبت نام درج کرده است به ثبت سفارش از گل پونه ، اقدام کند\n  طبق قانون تجارت الکترونیک مشتری یا مصرف کننده هر شخصی است که به منظوری جز تجارت یا شغل حرفه ای به خرید کالا یا خدمات اقدام می کند\n  هنگامی که شما از سرویس ها و خدمات گل پونه استفلاده می کنید ، سفارش اینترنتی خود را ثبت یا خرید می کنید این ارتباطات به صورت الکترونیکی انجام می شود و در صورتی که در خواست شما با رعایت کلیه اصول و رویه ها باشد ، شما موافقت می کنید که گل پونه به صورت الکترونیکی ( از طریق پست الکترونیکی ، سرویس پیام کوتاه و سایر سرویس های الکترونیکی ) به در خواست شما پاسخ دهد .\n\n\nهمچنین آدرس ایمیل و تلفن هایی که مشتری در پروفایل خود ثبت می کند ، تنها آدرس ایمیل و تلفن های رسمی و مورد تایید مشتری است و تمام مکاتبات و پاسخ های شرکت از طریق آن ها صورت می گیرد\nحفظ و امنیت نام کاربری و رمز عبور مرتبط با کاربر به عهده ایشان می باشد .\n\n\nسیاست های رعایت حریم شخصی\n   گل پونه به اطلاعات خصوص اشخاصی که از خدمات سایت استفاده می کنند ، احترام گذاشته و از آن محافظت می کند.  گل پونه متعهد می شود در حد توان از حریم شخصی شما دفاع کند و در این راستا ، تکنولوژی مورد نیاز برای هر چه مطمئن تر وامن تر شدن استفاده شما از سایت را ، توسعه دهد . در واقع با استفاده از سایت گل پونه ، شما رضایت خود را از این سایت نشان می دهید\n\nحقوق مصرف کنندگان محترم\nمصرف کننده حق دارد تا اطلاعات رایگان در مورد محصولات و خدمات دریافتی اخذ نماید.\nمصرف کننده حق دارد تا از تغییر در نوع محصولات و خدمات شرکت اطلاع یابد.\nمصرف کننده حق دارد محصولات و خدمات ما را به بهترین کیفیت در یافت نماید.\nمصرف کننده حق دارد تا از کارکنان انتظار برخورد مودبانه ،محترمانه و متخصصانه داشته باشد\nمصرف کننده حق دارد با امور مشتریان شرکت در تماس باشد\n",
                  exp[0],
                  0),
            ],
          ),
        ),
      ),
    );
  }

  Widget ruleItem(String title, String rule, bool ex, int ind) {
    if(rule.length <= 100){
      ex = true;
    }
    return SizedBox(
      child: Card(
        color: Colors.white,
        child: Column(
          children: [
            Text(
              title,
              style: Theme.of(context).textTheme.titleLarge,
            ),
            const SizedBox(
              height: 5.0,
            ),
            Padding(
              padding: const EdgeInsets.all(15.0),
              child: Text(
                ex ? rule : "${rule.substring(0, 800)}... ادامه",
                style: Theme.of(context).textTheme.bodyMedium, textAlign: TextAlign.justify,
                maxLines: !ex ? 12 : null,
              ),
            ),
            !ex
                ? IconButton(
                    onPressed: () {
                      setState(() {
                        exp[ind] = !exp[ind];
                      });
                    },
                    icon: const Icon(
                      Icons.expand_circle_down,
                      color: Colors.green,
                    ),
                  )
                : Container()
          ],
        ),
      ),
    );
  }
}
